; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_1 ?v1)
		(pred_4 ?v5)
		(pred_2 ?v5)
		(pred_6 ?v1 ?v5)
		(pred_3)
		(pred_5 ?v1))

   (:action op_1
       :parameters  (?v8 ?v4)
       :precondition (and (not-eq ?v8 ?v4) 
                          (pred_4 ?v8) (pred_4 ?v4) (pred_2 ?v8))
       :effect (and  (pred_2 ?v4)
		     (not (pred_2 ?v8))))


   (:action op_2
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_1 ?v3) (pred_4 ?v6)
			    (pred_6 ?v3 ?v6) (pred_2 ?v6) (pred_3))
       :effect (and (pred_5 ?v3)
		    (not (pred_6 ?v3 ?v6)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_1 ?v3) (pred_4 ?v6)
			    (pred_5 ?v3) (pred_2 ?v6))
       :effect (and (pred_6 ?v3 ?v6)
		    (pred_3)
		    (not (pred_5 ?v3)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_08 obj_04 obj_07 obj_01 obj_06 obj_02 
          obj_05 obj_03 
)
(:init
(pred_4 obj_08)
(pred_4 obj_04)
(pred_4 obj_07)
(pred_4 obj_01)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_1 obj_05)
(pred_1 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_3)
(pred_6 obj_05 obj_01)
(pred_6 obj_03 obj_07)
(pred_2 obj_07)
)
(:goal
(and
(pred_6 obj_05 obj_01)
(pred_6 obj_03 obj_02)
)
)

(:constraints
  (sometime-before  (pred_6 obj_03 obj_02) (pred_2 obj_08))
)
)

; plan
1. (op_2 obj_03 obj_07)
   deleted: (pred_6 obj_03 obj_07) (pred_3)
   added: (pred_5 obj_03)
   goals met: 1 of 2
2. (op_1 obj_07 obj_01)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_01)
   goals met: 1 of 2
3. (op_3 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_01) (pred_3)
   goals met: 1 of 2
4. (op_2 obj_05 obj_01)
   deleted: (pred_6 obj_05 obj_01) (pred_3)
   added: (pred_5 obj_05)
   goals met: 0 of 2
5. (op_1 obj_01 obj_08)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_08)
   goals met: 0 of 2
6. (op_3 obj_05 obj_08)
   deleted: (pred_5 obj_05)
   added: (pred_6 obj_05 obj_08) (pred_3)
   goals met: 0 of 2
7. (op_1 obj_08 obj_01)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_01)
   goals met: 0 of 2
8. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_03 obj_01) (pred_3)
   added: (pred_5 obj_03)
   goals met: 0 of 2
9. (op_1 obj_01 obj_02)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_02)
   goals met: 0 of 2
10. (op_3 obj_03 obj_02)
   deleted: (pred_5 obj_03)
   added: (pred_6 obj_03 obj_02) (pred_3)
   goals met: 1 of 2
11. (op_1 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 1 of 2
12. (op_2 obj_05 obj_08)
   deleted: (pred_6 obj_05 obj_08) (pred_3)
   added: (pred_5 obj_05)
   goals met: 1 of 2
13. (op_1 obj_08 obj_01)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_01)
   goals met: 1 of 2
14. (op_3 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_6 obj_05 obj_01) (pred_3)
   goals met: 2 of 2
